In [1]:
import pandas as pd

## Data Structures in Pandas

### Series:

In [9]:
x = [3,4,5,6]
ser = pd.Series(x)
ser1 = pd.Series(x, index=['a','b','c','d'], dtype=float, name="Practice Series")
print(ser)
print(ser1)
print("Acess through default index:",ser1[2],"\nAccess through given index:", ser1['c'])

0    3
1    4
2    5
3    6
dtype: int64
a    3.0
b    4.0
c    5.0
d    6.0
Name: Practice Series, dtype: float64
Acess through default index: 5.0
Access through given index: 5.0

In [16]:
dict = {"name":["Python","CPP","Java","php"], "pos":[15,22,66,39],"rank":[1,3,2,4]}
ser2 = pd.Series(dict)
print(ser2)
ranks = ser2["rank"]
print(ranks, ranks[2])

name    [Python, CPP, Java, php]
pos             [15, 22, 66, 39]
rank                [1, 3, 2, 4]
dtype: object
[1, 3, 2, 4] 2

In [19]:
print(pd.Series([1,3,5,7,9], dtype=int) + pd.Series([2,4,6,8], dtype=int))

0     3.0
1     7.0
2    11.0
3    15.0
4     NaN
dtype: float64

### DataFrame

In [23]:
l = [1,2,3,4,5,6]
df = pd.DataFrame(l)
df

   0
0  1
1  2
2  3
3  4
4  5
5  6

In [36]:
d = {"a":[1,3,5,7,9,11],"b":[0,2,4,6,8,10]}
df2 = pd.DataFrame(d)
print(df2)
print(type(df2))
print(df2["a"])
print(df2["a"][2])

    a   b
0   1   0
1   3   2
2   5   4
3   7   6
4   9   8
5  11  10
<class 'pandas.core.frame.DataFrame'>
0     1
1     3
2     5
3     7
4     9
5    11
Name: a, dtype: int64
5

In [38]:
df3 = pd.DataFrame(d,columns=["b"], index=['q','w','e','r','t','y'])
df3

    b
q   0
w   2
e   4
r   6
t   8
y  10

In [39]:
l2 = [[0,1,2,3],[6,7,8,9]]
df4 = pd.DataFrame(l2)
df4

   0  1  2  3
0  0  1  2  3
1  6  7  8  9

In [40]:
d2={"s":pd.Series([1,3,5,7]),"r":[2,4,6,8]}
df5 = pd.DataFrame(d2)
df5

   s  r
0  1  2
1  3  4
2  5  6
3  7  8

In [41]:
print(df5["s"][2])

5

### Arthemetic Operations

In [3]:
var1 = pd.DataFrame({"A":[0,2,4,6,8], "B":[1,3,5,7,9]})
var1

   A  B
0  0  1
1  2  3
2  4  5
3  6  7
4  8  9

In [5]:
var1["Sum"] = var1["A"]+var1["B"]
var1["Sub"] = var1["A"]-var1["B"]
var1["Mul"] = var1["A"]*var1["B"]
var1["Div"] = var1["A"]/var1["B"]
var1

   A  B  Sum  Sub  Mul       Div
0  0  1    1   -1    0  0.000000
1  2  3    5   -1    6  0.666667
2  4  5    9   -1   20  0.800000
3  6  7   13   -1   42  0.857143
4  8  9   17   -1   72  0.888889

### Logical Operations

In [8]:
var2 = pd.DataFrame({"A":[0,1,2,3,4,5,6,7,8,9]})

var2["Odd"] = var2["A"]%2 != 0
var2

   A    Odd
0  0  False
1  1   True
2  2  False
3  3   True
4  4  False
5  5   True
6  6  False
7  7   True
8  8  False
9  9   True

### Insertion

In [10]:
var3 = pd.DataFrame({"A":[1,2,3,4,5,6],"B":['q','w','e','r','t','y']})
var3

   A  B
0  1  q
1  2  w
2  3  e
3  4  r
4  5  t
5  6  y

In [11]:
var3.insert(1,"A1",['1q','2w','3e','4r','5t','6y'])
var3

   A  A1  B
0  1  1q  q
1  2  2w  w
2  3  3e  e
3  4  4r  r
4  5  5t  t
5  6  6y  y

In [13]:
var3["C"]=var3["A"][:3]
var3

   A  A1  B    C
0  1  1q  q  1.0
1  2  2w  w  2.0
2  3  3e  e  3.0
3  4  4r  r  NaN
4  5  5t  t  NaN
5  6  6y  y  NaN

### Deletion

In [14]:
b = var3.pop("B") #Deleted from Var3 and saved to b
print(b)
var3

0    q
1    w
2    e
3    r
4    t
5    y
Name: B, dtype: object

   A  A1    C
0  1  1q  1.0
1  2  2w  2.0
2  3  3e  3.0
3  4  4r  NaN
4  5  5t  NaN
5  6  6y  NaN

In [15]:
del var3["A"]
var3

   A1    C
0  1q  1.0
1  2w  2.0
2  3e  3.0
3  4r  NaN
4  5t  NaN
5  6y  NaN

### Writing to CSV

In [16]:
df_csv = pd.DataFrame({"Col1":[1,2,3,4,5,6],"Col2":['q','w','e','r','t','y'], "Col3":['a1','s2','d3','f4','g5','h6']})
df_csv

   Col1 Col2 Col3
0     1    q   a1
1     2    w   s2
2     3    e   d3
3     4    r   f4
4     5    t   g5
5     6    y   h6

In [19]:
df_csv.to_csv("PracticeWritingCSV.csv",index=False) #df_csv.to_csv("PracticeWritingCSV",index=False, header[1,2,3,4,5,6]) for new header

### Reading CSV

In [20]:
df = pd.read_csv("Practice_Dataset.csv")
df

,StockID,StockName,Date,OpeningPrice,ClosingPrice,Volume,MarketCap,PE_Ratio,DividendYield,Sector
0,1,Stock_1,2024-03-17,403.21,186.70,143175,6.505402e+11,16.64,0.81,Healthcare
1,2,Stock_2,2024-02-11,395.96,377.70,201937,7.557405e+11,44.14,2.34,Healthcare
2,3,Stock_3,2024-09-21,244.89,150.91,493048,9.032548e+10,16.04,4.98,Technology
3,4,Stock_4,2024-10-12,197.23,342.65,723463,3.893175e+11,35.60,2.68,Healthcare
4,5,Stock_5,2024-02-10,397.50,439.90,856814,9.866424e+11,44.91,1.49,Finance
...,...,...,...,...,...,...,...,...,...,...
995,996,Stock_996,2024-11-07,NaN,458.08,78212,4.955035e+11,33.54,0.75,Consumer Goods
996,997,Stock_997,2024-01-05,332.24,151.44,795331,6.523931e+11,49.27,0.87,Technology
997,998,Stock_998,2024-01-15,174.39,236.24,489014,4.580002e+10,16.75,2.39,Technology
998,999,Stock_999,2024-01-23,235.27,223.29,618597,9.708860e+11,31.24,2.09,Consumer Goods
999,1000,Stock_1000,2023-12-21,350.10,385.36,921650,6.562584e+11,11.34,0.77,Finance

In [41]:
dfl = pd.read_csv("Practice_Dataset.csv",dtype={"StockID":"float"}, skiprows=[2], nrows=6, usecols=["StockID","StockName","OpeningPrice","ClosingPrice"]) #Can also use indexes of coloumns [1,3,4]
dfl

   StockID StockName  OpeningPrice  ClosingPrice
0      1.0   Stock_1        403.21        186.70
1      3.0   Stock_3        244.89        150.91
2      4.0   Stock_4        197.23        342.65
3      5.0   Stock_5        397.50        439.90
4      6.0   Stock_6        479.95        371.40
5      7.0   Stock_7        193.06        178.91

In [32]:
dfl2 = pd.read_csv("Practice_Dataset.csv",skiprows=[2], nrows=6, usecols=[0,1,3,4],
                  index_col=0, names = ["col1","col2","col3","col4"]) 
dfl2

              col2          col3          col4
col1
StockID  StockName  OpeningPrice  ClosingPrice
1          Stock_1        403.21         186.7
3          Stock_3        244.89        150.91
4          Stock_4        197.23        342.65
5          Stock_5         397.5         439.9
6          Stock_6        479.95         371.4

### Data Manipulation

In [47]:
toyota = pd.read_csv("Toyota.csv")
toyota.head()

  Vehicle Name  Model Year  Engine Capacity (L)  Price ($)  Seating Capacity
0      Corolla        2023                  1.8      21000                 5
1        Camry        2022                  2.5      26000                 5
2         RAV4        2023                  2.5      28000                 5
3   Highlander        2022                  3.5      35000                 7
4       Tacoma        2023                  3.5      33000                 5

In [48]:
toyota.index

RangeIndex(start=0, stop=25, step=1)

In [49]:
toyota.columns

Index(['Vehicle Name', 'Model Year', 'Engine Capacity (L)', 'Price ($)',
       'Seating Capacity'],
      dtype='object')

In [51]:
toyota.describe()

        Model Year  Engine Capacity (L)     Price ($)  Seating Capacity
count    25.000000             25.00000     25.000000         25.000000
mean   2018.200000              2.68400  31560.000000          5.160000
std       9.309493              1.19676  16078.142513          1.374773
min    1995.000000              1.50000  12000.000000          2.000000
25%    2021.000000              1.80000  21000.000000          5.000000
50%    2022.000000              2.40000  28000.000000          5.000000
75%    2023.000000              3.50000  38000.000000          5.000000
max    2023.000000              5.70000  85000.000000          8.000000

In [53]:
toyota.tail()

   Vehicle Name  Model Year  Engine Capacity (L)  Price ($)  Seating Capacity
20         Echo        2019                  1.5      17000                 5
21          MR2        2000                  2.0      23000                 2
22        Paseo        1998                  1.5      14000                 5
23       Tercel        1997                  1.5      12000                 5
24       Previa        1995                  2.4      22000                 7

In [54]:
toyota.index.array

<PandasArray>
[ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17, 18,
 19, 20, 21, 22, 23, 24]
Length: 25, dtype: int64

In [56]:
import numpy as np
v = np.array(toyota)
v

array([['Corolla', 2023, 1.8, 21000, 5],
       ['Camry', 2022, 2.5, 26000, 5],
       ['RAV4', 2023, 2.5, 28000, 5],
       ['Highlander', 2022, 3.5, 35000, 7],
       ['Tacoma', 2023, 3.5, 33000, 5],
       ['Tundra', 2023, 3.5, 38000, 6],
       ['Prius', 2023, 1.8, 25000, 5],
       ['Avalon', 2022, 3.5, 36000, 5],
       ['Yaris', 2021, 1.5, 15000, 5],
       ['C-HR', 2023, 2.0, 24000, 5],
       ['Supra', 2023, 3.0, 43000, 2],
       ['Sequoia', 2022, 5.7, 58000, 7],
       ['4Runner', 2023, 4.0, 40000, 5],
       ['Land Cruiser', 2021, 5.7, 85000, 8],
       ['Sienna', 2023, 3.5, 34000, 7],
       ['Venza', 2023, 2.5, 30000, 5],
       ['Mirai', 2022, 1.5, 50000, 4],
       ['Crown', 2023, 2.4, 42000, 5],
       ['Matrix', 2021, 1.8, 18000, 5],
       ['Celica', 2020, 2.0, 20000, 4],
       ['Echo', 2019, 1.5, 17000, 5],
       ['MR2', 2000, 2.0, 23000, 2],
       ['Paseo', 1998, 1.5, 14000, 5],
       ['Tercel', 1997, 1.5, 12000, 5],
       ['Previa', 1995, 2.4, 22000, 7]], dtype=object)

In [57]:
toyota.sort_index(axis=0,ascending=False) #axis=1 for colums

    Vehicle Name  Model Year  Engine Capacity (L)  Price ($)  Seating Capacity
24        Previa        1995                  2.4      22000                 7
23        Tercel        1997                  1.5      12000                 5
22         Paseo        1998                  1.5      14000                 5
21           MR2        2000                  2.0      23000                 2
20          Echo        2019                  1.5      17000                 5
19        Celica        2020                  2.0      20000                 4
18        Matrix        2021                  1.8      18000                 5
17         Crown        2023                  2.4      42000                 5
16         Mirai        2022                  1.5      50000                 4
15         Venza        2023                  2.5      30000                 5
14        Sienna        2023                  3.5      34000                 7
13  Land Cruiser        2021                  5.7      85000                 8
12       4Runner        2023                  4.0      40000                 5
11       Sequoia        2022                  5.7      58000                 7
10         Supra        2023                  3.0      43000                 2
9           C-HR        2023                  2.0      24000                 5
8          Yaris        2021                  1.5      15000                 5
7         Avalon        2022                  3.5      36000                 5
6          Prius        2023                  1.8      25000                 5
5         Tundra        2023                  3.5      38000                 6
4         Tacoma        2023                  3.5      33000                 5
3     Highlander        2022                  3.5      35000                 7
2           RAV4        2023                  2.5      28000                 5
1          Camry        2022                  2.5      26000                 5
0        Corolla        2023                  1.8      21000                 5

### Changing Values

In [60]:
toyota["Vehicle Name"][3]="Jeep"
toyota.head()

c:\users\administrator\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

  Vehicle Name  Model Year  Engine Capacity (L)  Price ($)  Seating Capacity
0      Corolla        2023                  1.8      21000                 5
1        Camry        2022                  2.5      26000                 5
2         RAV4        2023                  2.5      28000                 5
3         Jeep        2022                  3.5      35000                 7
4       Tacoma        2023                  3.5      33000                 5

In [62]:
toyota.loc[3,"Vehicle Name"]="Hilux"
toyota.head()

  Vehicle Name  Model Year  Engine Capacity (L)  Price ($)  Seating Capacity
0      Corolla        2023                  1.8      21000                 5
1        Camry        2022                  2.5      26000                 5
2         RAV4        2023                  2.5      28000                 5
3        Hilux        2022                  3.5      35000                 7
4       Tacoma        2023                  3.5      33000                 5

### Getting and Dropping Data

In [66]:
toyota.iloc[0,2]

1.8

In [68]:
toyota.drop("Vehicle Name",axis=1)

    Model Year  Engine Capacity (L)  Price ($)  Seating Capacity
0         2023                  1.8      21000                 5
1         2022                  2.5      26000                 5
2         2023                  2.5      28000                 5
3         2022                  3.5      35000                 7
4         2023                  3.5      33000                 5
5         2023                  3.5      38000                 6
6         2023                  1.8      25000                 5
7         2022                  3.5      36000                 5
8         2021                  1.5      15000                 5
9         2023                  2.0      24000                 5
10        2023                  3.0      43000                 2
11        2022                  5.7      58000                 7
12        2023                  4.0      40000                 5
13        2021                  5.7      85000                 8
14        2023                  3.5      34000                 7
15        2023                  2.5      30000                 5
16        2022                  1.5      50000                 4
17        2023                  2.4      42000                 5
18        2021                  1.8      18000                 5
19        2020                  2.0      20000                 4
20        2019                  1.5      17000                 5
21        2000                  2.0      23000                 2
22        1998                  1.5      14000                 5
23        1997                  1.5      12000                 5
24        1995                  2.4      22000                 7

### Hadelling Missing Values (dropna & filna)

In [80]:
ms = pd.read_csv("Toyota.csv")
ms

    Vehicle Name  Model Year  Engine Capacity (L)  Price ($)  Seating Capacity
0        Corolla      2023.0                  1.8    21000.0               5.0
1          Camry      2022.0                  2.5    26000.0               5.0
2           RAV4      2023.0                  2.5    28000.0               5.0
3     Highlander      2022.0                  3.5    35000.0               7.0
4         Tacoma      2023.0                  3.5    33000.0               5.0
5         Tundra      2023.0                  3.5    38000.0               6.0
6          Prius      2023.0                  1.8    25000.0               5.0
7         Avalon      2022.0                  3.5    36000.0               5.0
8          Yaris      2021.0                  1.5    15000.0               5.0
9           C-HR      2023.0                  2.0    24000.0               5.0
10         Supra      2023.0                  3.0        NaN               2.0
11       Sequoia      2022.0                  5.7    58000.0               7.0
12       4Runner      2023.0                  4.0    40000.0               5.0
13  Land Cruiser      2021.0                  5.7    85000.0               8.0
14           NaN      2023.0                  3.5    34000.0               7.0
15         Venza         NaN                  2.5    30000.0               5.0
16         Mirai      2022.0                  1.5        NaN               4.0
17         Crown      2023.0                  2.4    42000.0               5.0
18        Matrix      2021.0                  1.8    18000.0               NaN
19        Celica      2020.0                  2.0    20000.0               4.0
20          Echo      2019.0                  1.5    17000.0               5.0
21           MR2      2000.0                  2.0    23000.0               2.0
22         Paseo      1998.0                  1.5    14000.0               5.0
23        Tercel      1997.0                  1.5    12000.0               5.0
24        Previa      1995.0                  NaN    22000.0               7.0

In [74]:
ms.dropna() # Dropping rows with Nan values, axis=1 for columns

    Vehicle Name  Model Year  Engine Capacity (L)  Price ($)  Seating Capacity
0        Corolla      2023.0                  1.8    21000.0               5.0
1          Camry      2022.0                  2.5    26000.0               5.0
2           RAV4      2023.0                  2.5    28000.0               5.0
3     Highlander      2022.0                  3.5    35000.0               7.0
4         Tacoma      2023.0                  3.5    33000.0               5.0
5         Tundra      2023.0                  3.5    38000.0               6.0
6          Prius      2023.0                  1.8    25000.0               5.0
7         Avalon      2022.0                  3.5    36000.0               5.0
8          Yaris      2021.0                  1.5    15000.0               5.0
9           C-HR      2023.0                  2.0    24000.0               5.0
11       Sequoia      2022.0                  5.7    58000.0               7.0
12       4Runner      2023.0                  4.0    40000.0               5.0
13  Land Cruiser      2021.0                  5.7    85000.0               8.0
17         Crown      2023.0                  2.4    42000.0               5.0
19        Celica      2020.0                  2.0    20000.0               4.0
20          Echo      2019.0                  1.5    17000.0               5.0
21           MR2      2000.0                  2.0    23000.0               2.0
22         Paseo      1998.0                  1.5    14000.0               5.0
23        Tercel      1997.0                  1.5    12000.0               5.0

In [76]:
ms.dropna(how="any") #Dropping full Nan row

    Vehicle Name  Model Year  Engine Capacity (L)  Price ($)  Seating Capacity
0        Corolla      2023.0                  1.8    21000.0               5.0
1          Camry      2022.0                  2.5    26000.0               5.0
2           RAV4      2023.0                  2.5    28000.0               5.0
3     Highlander      2022.0                  3.5    35000.0               7.0
4         Tacoma      2023.0                  3.5    33000.0               5.0
5         Tundra      2023.0                  3.5    38000.0               6.0
6          Prius      2023.0                  1.8    25000.0               5.0
7         Avalon      2022.0                  3.5    36000.0               5.0
8          Yaris      2021.0                  1.5    15000.0               5.0
9           C-HR      2023.0                  2.0    24000.0               5.0
11       Sequoia      2022.0                  5.7    58000.0               7.0
12       4Runner      2023.0                  4.0    40000.0               5.0
13  Land Cruiser      2021.0                  5.7    85000.0               8.0
17         Crown      2023.0                  2.4    42000.0               5.0
19        Celica      2020.0                  2.0    20000.0               4.0
20          Echo      2019.0                  1.5    17000.0               5.0
21           MR2      2000.0                  2.0    23000.0               2.0
22         Paseo      1998.0                  1.5    14000.0               5.0
23        Tercel      1997.0                  1.5    12000.0               5.0

In [78]:
ms.dropna(inplace=True)#To remove Nan rows and creating new DataSet
ms

    Vehicle Name  Model Year  Engine Capacity (L)  Price ($)  Seating Capacity
0        Corolla      2023.0                  1.8    21000.0               5.0
1          Camry      2022.0                  2.5    26000.0               5.0
2           RAV4      2023.0                  2.5    28000.0               5.0
3     Highlander      2022.0                  3.5    35000.0               7.0
4         Tacoma      2023.0                  3.5    33000.0               5.0
5         Tundra      2023.0                  3.5    38000.0               6.0
6          Prius      2023.0                  1.8    25000.0               5.0
7         Avalon      2022.0                  3.5    36000.0               5.0
8          Yaris      2021.0                  1.5    15000.0               5.0
9           C-HR      2023.0                  2.0    24000.0               5.0
11       Sequoia      2022.0                  5.7    58000.0               7.0
12       4Runner      2023.0                  4.0    40000.0               5.0
13  Land Cruiser      2021.0                  5.7    85000.0               8.0
17         Crown      2023.0                  2.4    42000.0               5.0
19        Celica      2020.0                  2.0    20000.0               4.0
20          Echo      2019.0                  1.5    17000.0               5.0
21           MR2      2000.0                  2.0    23000.0               2.0
22         Paseo      1998.0                  1.5    14000.0               5.0
23        Tercel      1997.0                  1.5    12000.0               5.0

In [2]:
ms = pd.read_csv("Toyota.csv")

ms.fillna("Dumy")

    Vehicle Name Model Year Engine Capacity (L) Price ($) Seating Capacity
0        Corolla       2023                 1.8     21000                5
1          Camry       2022                 2.5     26000                5
2           RAV4       2023                 2.5     28000                5
3     Highlander       2022                 3.5     35000                7
4         Tacoma       2023                 3.5     33000                5
5         Tundra       2023                 3.5     38000                6
6          Prius       2023                 1.8     25000                5
7         Avalon       2022                 3.5     36000                5
8          Yaris       2021                 1.5     15000                5
9           C-HR       2023                   2     24000                5
10         Supra       2023                   3      Dumy                2
11       Sequoia       2022                 5.7     58000                7
12       4Runner       2023                   4     40000                5
13  Land Cruiser       2021                 5.7     85000                8
14          Dumy       2023                 3.5     34000                7
15         Venza       Dumy                 2.5     30000                5
16         Mirai       2022                 1.5      Dumy                4
17         Crown       2023                 2.4     42000                5
18        Matrix       2021                 1.8     18000             Dumy
19        Celica       2020                   2     20000                4
20          Echo       2019                 1.5     17000                5
21           MR2       2000                   2     23000                2
22         Paseo       1998                 1.5     14000                5
23        Tercel       1997                 1.5     12000                5
24        Previa       1995                Dumy     22000                7

In [97]:
ms=ms.dropna(subset=["Vehicle Name"], inplace=False)
ms = ms.fillna({"Seating Capacity":ms["Seating Capacity"].median(),"Price ($)":int(ms["Price ($)"].mean()),"Engine Capacity (L)":int(ms["Engine Capacity (L)"].mean()),"Model Year":int(ms["Model Year"].mean())})
ms

    Vehicle Name  Model Year  Engine Capacity (L)  Price ($)  Seating Capacity
0        Corolla      2023.0                  1.8    21000.0               5.0
1          Camry      2022.0                  2.5    26000.0               5.0
2           RAV4      2023.0                  2.5    28000.0               5.0
3     Highlander      2022.0                  3.5    35000.0               7.0
4         Tacoma      2023.0                  3.5    33000.0               5.0
5         Tundra      2023.0                  3.5    38000.0               6.0
6          Prius      2023.0                  1.8    25000.0               5.0
7         Avalon      2022.0                  3.5    36000.0               5.0
8          Yaris      2021.0                  1.5    15000.0               5.0
9           C-HR      2023.0                  2.0    24000.0               5.0
10         Supra      2023.0                  3.0    30260.0               2.0
11       Sequoia      2022.0                  5.7    58000.0               7.0
12       4Runner      2023.0                  4.0    40000.0               5.0
13  Land Cruiser      2021.0                  5.7    85000.0               8.0
15         Venza      2017.0                  2.5    30000.0               5.0
16         Mirai      2022.0                  1.5    30260.0               4.0
17         Crown      2023.0                  2.4    42000.0               5.0
18        Matrix      2021.0                  1.8    18000.0               5.0
19        Celica      2020.0                  2.0    20000.0               4.0
20          Echo      2019.0                  1.5    17000.0               5.0
21           MR2      2000.0                  2.0    23000.0               2.0
22         Paseo      1998.0                  1.5    14000.0               5.0
23        Tercel      1997.0                  1.5    12000.0               5.0
24        Previa      1995.0                  2.0    22000.0               7.0

In [3]:
ms.replace(to_replace=5, value=15)

    Vehicle Name  Model Year  Engine Capacity (L)  Price ($)  Seating Capacity
0        Corolla      2023.0                  1.8    21000.0              15.0
1          Camry      2022.0                  2.5    26000.0              15.0
2           RAV4      2023.0                  2.5    28000.0              15.0
3     Highlander      2022.0                  3.5    35000.0               7.0
4         Tacoma      2023.0                  3.5    33000.0              15.0
5         Tundra      2023.0                  3.5    38000.0               6.0
6          Prius      2023.0                  1.8    25000.0              15.0
7         Avalon      2022.0                  3.5    36000.0              15.0
8          Yaris      2021.0                  1.5    15000.0              15.0
9           C-HR      2023.0                  2.0    24000.0              15.0
10         Supra      2023.0                  3.0        NaN               2.0
11       Sequoia      2022.0                  5.7    58000.0               7.0
12       4Runner      2023.0                  4.0    40000.0              15.0
13  Land Cruiser      2021.0                  5.7    85000.0               8.0
14           NaN      2023.0                  3.5    34000.0               7.0
15         Venza         NaN                  2.5    30000.0              15.0
16         Mirai      2022.0                  1.5        NaN               4.0
17         Crown      2023.0                  2.4    42000.0              15.0
18        Matrix      2021.0                  1.8    18000.0               NaN
19        Celica      2020.0                  2.0    20000.0               4.0
20          Echo      2019.0                  1.5    17000.0              15.0
21           MR2      2000.0                  2.0    23000.0               2.0
22         Paseo      1998.0                  1.5    14000.0              15.0
23        Tercel      1997.0                  1.5    12000.0              15.0
24        Previa      1995.0                  NaN    22000.0               7.0

In [4]:
ms.replace({"Vehicle Name":['A-Z']},22,regex=True)

    Vehicle Name  Model Year  Engine Capacity (L)  Price ($)  Seating Capacity
0        Corolla      2023.0                  1.8    21000.0               5.0
1          Camry      2022.0                  2.5    26000.0               5.0
2           RAV4      2023.0                  2.5    28000.0               5.0
3     Highlander      2022.0                  3.5    35000.0               7.0
4         Tacoma      2023.0                  3.5    33000.0               5.0
5         Tundra      2023.0                  3.5    38000.0               6.0
6          Prius      2023.0                  1.8    25000.0               5.0
7         Avalon      2022.0                  3.5    36000.0               5.0
8          Yaris      2021.0                  1.5    15000.0               5.0
9           C-HR      2023.0                  2.0    24000.0               5.0
10         Supra      2023.0                  3.0        NaN               2.0
11       Sequoia      2022.0                  5.7    58000.0               7.0
12       4Runner      2023.0                  4.0    40000.0               5.0
13  Land Cruiser      2021.0                  5.7    85000.0               8.0
14           NaN      2023.0                  3.5    34000.0               7.0
15         Venza         NaN                  2.5    30000.0               5.0
16         Mirai      2022.0                  1.5        NaN               4.0
17         Crown      2023.0                  2.4    42000.0               5.0
18        Matrix      2021.0                  1.8    18000.0               NaN
19        Celica      2020.0                  2.0    20000.0               4.0
20          Echo      2019.0                  1.5    17000.0               5.0
21           MR2      2000.0                  2.0    23000.0               2.0
22         Paseo      1998.0                  1.5    14000.0               5.0
23        Tercel      1997.0                  1.5    12000.0               5.0
24        Previa      1995.0                  NaN    22000.0               7.0

In [5]:
ms.replace(1,method="ffill")

    Vehicle Name  Model Year  Engine Capacity (L)  Price ($)  Seating Capacity
0        Corolla      2023.0                  1.8    21000.0               5.0
1          Camry      2022.0                  2.5    26000.0               5.0
2           RAV4      2023.0                  2.5    28000.0               5.0
3     Highlander      2022.0                  3.5    35000.0               7.0
4         Tacoma      2023.0                  3.5    33000.0               5.0
5         Tundra      2023.0                  3.5    38000.0               6.0
6          Prius      2023.0                  1.8    25000.0               5.0
7         Avalon      2022.0                  3.5    36000.0               5.0
8          Yaris      2021.0                  1.5    15000.0               5.0
9           C-HR      2023.0                  2.0    24000.0               5.0
10         Supra      2023.0                  3.0        NaN               2.0
11       Sequoia      2022.0                  5.7    58000.0               7.0
12       4Runner      2023.0                  4.0    40000.0               5.0
13  Land Cruiser      2021.0                  5.7    85000.0               8.0
14           NaN      2023.0                  3.5    34000.0               7.0
15         Venza         NaN                  2.5    30000.0               5.0
16         Mirai      2022.0                  1.5        NaN               4.0
17         Crown      2023.0                  2.4    42000.0               5.0
18        Matrix      2021.0                  1.8    18000.0               NaN
19        Celica      2020.0                  2.0    20000.0               4.0
20          Echo      2019.0                  1.5    17000.0               5.0
21           MR2      2000.0                  2.0    23000.0               2.0
22         Paseo      1998.0                  1.5    14000.0               5.0
23        Tercel      1997.0                  1.5    12000.0               5.0
24        Previa      1995.0                  NaN    22000.0               7.0

In [3]:
ms = pd.read_csv("Toyota.csv")

In [5]:
ms.replace(2023.0,method="bfill")

    Vehicle Name  Model Year  Engine Capacity (L)  Price ($)  Seating Capacity
0        Corolla      2022.0                  1.8    21000.0               5.0
1          Camry      2022.0                  2.5    26000.0               5.0
2           RAV4      2022.0                  2.5    28000.0               5.0
3     Highlander      2022.0                  3.5    35000.0               7.0
4         Tacoma      2022.0                  3.5    33000.0               5.0
5         Tundra      2022.0                  3.5    38000.0               6.0
6          Prius      2022.0                  1.8    25000.0               5.0
7         Avalon      2022.0                  3.5    36000.0               5.0
8          Yaris      2021.0                  1.5    15000.0               5.0
9           C-HR      2022.0                  2.0    24000.0               5.0
10         Supra      2022.0                  3.0        NaN               2.0
11       Sequoia      2022.0                  5.7    58000.0               7.0
12       4Runner      2021.0                  4.0    40000.0               5.0
13  Land Cruiser      2021.0                  5.7    85000.0               8.0
14           NaN         NaN                  3.5    34000.0               7.0
15         Venza         NaN                  2.5    30000.0               5.0
16         Mirai      2022.0                  1.5        NaN               4.0
17         Crown      2021.0                  2.4    42000.0               5.0
18        Matrix      2021.0                  1.8    18000.0               NaN
19        Celica      2020.0                  2.0    20000.0               4.0
20          Echo      2019.0                  1.5    17000.0               5.0
21           MR2      2000.0                  2.0    23000.0               2.0
22         Paseo      1998.0                  1.5    14000.0               5.0
23        Tercel      1997.0                  1.5    12000.0               5.0
24        Previa      1995.0                  NaN    22000.0               7.0

### Interpolate

In [6]:
ms.interpolate()

    Vehicle Name  Model Year  Engine Capacity (L)  Price ($)  Seating Capacity
0        Corolla      2023.0                  1.8    21000.0               5.0
1          Camry      2022.0                  2.5    26000.0               5.0
2           RAV4      2023.0                  2.5    28000.0               5.0
3     Highlander      2022.0                  3.5    35000.0               7.0
4         Tacoma      2023.0                  3.5    33000.0               5.0
5         Tundra      2023.0                  3.5    38000.0               6.0
6          Prius      2023.0                  1.8    25000.0               5.0
7         Avalon      2022.0                  3.5    36000.0               5.0
8          Yaris      2021.0                  1.5    15000.0               5.0
9           C-HR      2023.0                  2.0    24000.0               5.0
10         Supra      2023.0                  3.0    41000.0               2.0
11       Sequoia      2022.0                  5.7    58000.0               7.0
12       4Runner      2023.0                  4.0    40000.0               5.0
13  Land Cruiser      2021.0                  5.7    85000.0               8.0
14           NaN      2023.0                  3.5    34000.0               7.0
15         Venza      2022.5                  2.5    30000.0               5.0
16         Mirai      2022.0                  1.5    36000.0               4.0
17         Crown      2023.0                  2.4    42000.0               5.0
18        Matrix      2021.0                  1.8    18000.0               4.5
19        Celica      2020.0                  2.0    20000.0               4.0
20          Echo      2019.0                  1.5    17000.0               5.0
21           MR2      2000.0                  2.0    23000.0               2.0
22         Paseo      1998.0                  1.5    14000.0               5.0
23        Tercel      1997.0                  1.5    12000.0               5.0
24        Previa      1995.0                  1.5    22000.0               7.0

In [10]:
ms.interpolate(method="linear")

    Vehicle Name  Model Year  Engine Capacity (L)  Price ($)  Seating Capacity
0        Corolla      2023.0                  1.8    21000.0               5.0
1          Camry      2022.0                  2.5    26000.0               5.0
2           RAV4      2023.0                  2.5    28000.0               5.0
3     Highlander      2022.0                  3.5    35000.0               7.0
4         Tacoma      2023.0                  3.5    33000.0               5.0
5         Tundra      2023.0                  3.5    38000.0               6.0
6          Prius      2023.0                  1.8    25000.0               5.0
7         Avalon      2022.0                  3.5    36000.0               5.0
8          Yaris      2021.0                  1.5    15000.0               5.0
9           C-HR      2023.0                  2.0    24000.0               5.0
10         Supra      2023.0                  3.0    41000.0               2.0
11       Sequoia      2022.0                  5.7    58000.0               7.0
12       4Runner      2023.0                  4.0    40000.0               5.0
13  Land Cruiser      2021.0                  5.7    85000.0               8.0
14           NaN      2023.0                  3.5    34000.0               7.0
15         Venza      2022.5                  2.5    30000.0               5.0
16         Mirai      2022.0                  1.5    36000.0               4.0
17         Crown      2023.0                  2.4    42000.0               5.0
18        Matrix      2021.0                  1.8    18000.0               4.5
19        Celica      2020.0                  2.0    20000.0               4.0
20          Echo      2019.0                  1.5    17000.0               5.0
21           MR2      2000.0                  2.0    23000.0               2.0
22         Paseo      1998.0                  1.5    14000.0               5.0
23        Tercel      1997.0                  1.5    12000.0               5.0
24        Previa      1995.0                  1.5    22000.0               7.0

In [11]:
ms.interpolate(method="linear", axis=0)

    Vehicle Name  Model Year  Engine Capacity (L)  Price ($)  Seating Capacity
0        Corolla      2023.0                  1.8    21000.0               5.0
1          Camry      2022.0                  2.5    26000.0               5.0
2           RAV4      2023.0                  2.5    28000.0               5.0
3     Highlander      2022.0                  3.5    35000.0               7.0
4         Tacoma      2023.0                  3.5    33000.0               5.0
5         Tundra      2023.0                  3.5    38000.0               6.0
6          Prius      2023.0                  1.8    25000.0               5.0
7         Avalon      2022.0                  3.5    36000.0               5.0
8          Yaris      2021.0                  1.5    15000.0               5.0
9           C-HR      2023.0                  2.0    24000.0               5.0
10         Supra      2023.0                  3.0    41000.0               2.0
11       Sequoia      2022.0                  5.7    58000.0               7.0
12       4Runner      2023.0                  4.0    40000.0               5.0
13  Land Cruiser      2021.0                  5.7    85000.0               8.0
14           NaN      2023.0                  3.5    34000.0               7.0
15         Venza      2022.5                  2.5    30000.0               5.0
16         Mirai      2022.0                  1.5    36000.0               4.0
17         Crown      2023.0                  2.4    42000.0               5.0
18        Matrix      2021.0                  1.8    18000.0               4.5
19        Celica      2020.0                  2.0    20000.0               4.0
20          Echo      2019.0                  1.5    17000.0               5.0
21           MR2      2000.0                  2.0    23000.0               2.0
22         Paseo      1998.0                  1.5    14000.0               5.0
23        Tercel      1997.0                  1.5    12000.0               5.0
24        Previa      1995.0                  1.5    22000.0               7.0

In [12]:
ms.interpolate(limit=2)

    Vehicle Name  Model Year  Engine Capacity (L)  Price ($)  Seating Capacity
0        Corolla      2023.0                  1.8    21000.0               5.0
1          Camry      2022.0                  2.5    26000.0               5.0
2           RAV4      2023.0                  2.5    28000.0               5.0
3     Highlander      2022.0                  3.5    35000.0               7.0
4         Tacoma      2023.0                  3.5    33000.0               5.0
5         Tundra      2023.0                  3.5    38000.0               6.0
6          Prius      2023.0                  1.8    25000.0               5.0
7         Avalon      2022.0                  3.5    36000.0               5.0
8          Yaris      2021.0                  1.5    15000.0               5.0
9           C-HR      2023.0                  2.0    24000.0               5.0
10         Supra      2023.0                  3.0    41000.0               2.0
11       Sequoia      2022.0                  5.7    58000.0               7.0
12       4Runner      2023.0                  4.0    40000.0               5.0
13  Land Cruiser      2021.0                  5.7    85000.0               8.0
14           NaN      2023.0                  3.5    34000.0               7.0
15         Venza      2022.5                  2.5    30000.0               5.0
16         Mirai      2022.0                  1.5    36000.0               4.0
17         Crown      2023.0                  2.4    42000.0               5.0
18        Matrix      2021.0                  1.8    18000.0               4.5
19        Celica      2020.0                  2.0    20000.0               4.0
20          Echo      2019.0                  1.5    17000.0               5.0
21           MR2      2000.0                  2.0    23000.0               2.0
22         Paseo      1998.0                  1.5    14000.0               5.0
23        Tercel      1997.0                  1.5    12000.0               5.0
24        Previa      1995.0                  1.5    22000.0               7.0

In [15]:
ms.interpolate(limit_direction="backward",limit=2)#backward, forward, both

    Vehicle Name  Model Year  Engine Capacity (L)  Price ($)  Seating Capacity
0        Corolla      2023.0                  1.8    21000.0               5.0
1          Camry      2022.0                  2.5    26000.0               5.0
2           RAV4      2023.0                  2.5    28000.0               5.0
3     Highlander      2022.0                  3.5    35000.0               7.0
4         Tacoma      2023.0                  3.5    33000.0               5.0
5         Tundra      2023.0                  3.5    38000.0               6.0
6          Prius      2023.0                  1.8    25000.0               5.0
7         Avalon      2022.0                  3.5    36000.0               5.0
8          Yaris      2021.0                  1.5    15000.0               5.0
9           C-HR      2023.0                  2.0    24000.0               5.0
10         Supra      2023.0                  3.0    41000.0               2.0
11       Sequoia      2022.0                  5.7    58000.0               7.0
12       4Runner      2023.0                  4.0    40000.0               5.0
13  Land Cruiser      2021.0                  5.7    85000.0               8.0
14           NaN      2023.0                  3.5    34000.0               7.0
15         Venza      2022.5                  2.5    30000.0               5.0
16         Mirai      2022.0                  1.5    36000.0               4.0
17         Crown      2023.0                  2.4    42000.0               5.0
18        Matrix      2021.0                  1.8    18000.0               4.5
19        Celica      2020.0                  2.0    20000.0               4.0
20          Echo      2019.0                  1.5    17000.0               5.0
21           MR2      2000.0                  2.0    23000.0               2.0
22         Paseo      1998.0                  1.5    14000.0               5.0
23        Tercel      1997.0                  1.5    12000.0               5.0
24        Previa      1995.0                  NaN    22000.0               7.0

In [16]:
ms.interpolate(limit_area="inside")

    Vehicle Name  Model Year  Engine Capacity (L)  Price ($)  Seating Capacity
0        Corolla      2023.0                  1.8    21000.0               5.0
1          Camry      2022.0                  2.5    26000.0               5.0
2           RAV4      2023.0                  2.5    28000.0               5.0
3     Highlander      2022.0                  3.5    35000.0               7.0
4         Tacoma      2023.0                  3.5    33000.0               5.0
5         Tundra      2023.0                  3.5    38000.0               6.0
6          Prius      2023.0                  1.8    25000.0               5.0
7         Avalon      2022.0                  3.5    36000.0               5.0
8          Yaris      2021.0                  1.5    15000.0               5.0
9           C-HR      2023.0                  2.0    24000.0               5.0
10         Supra      2023.0                  3.0    41000.0               2.0
11       Sequoia      2022.0                  5.7    58000.0               7.0
12       4Runner      2023.0                  4.0    40000.0               5.0
13  Land Cruiser      2021.0                  5.7    85000.0               8.0
14           NaN      2023.0                  3.5    34000.0               7.0
15         Venza      2022.5                  2.5    30000.0               5.0
16         Mirai      2022.0                  1.5    36000.0               4.0
17         Crown      2023.0                  2.4    42000.0               5.0
18        Matrix      2021.0                  1.8    18000.0               4.5
19        Celica      2020.0                  2.0    20000.0               4.0
20          Echo      2019.0                  1.5    17000.0               5.0
21           MR2      2000.0                  2.0    23000.0               2.0
22         Paseo      1998.0                  1.5    14000.0               5.0
23        Tercel      1997.0                  1.5    12000.0               5.0
24        Previa      1995.0                  NaN    22000.0               7.0

### Merge

In [20]:
df1=pd.DataFrame({"A":[1,2,3,4], "B":[7,8,9,0]})
df2=pd.DataFrame({"A":[1,2,3,5], "C":[6,7,8,9]})
pd.merge(df1,df2,on="A")

   A  B  C
0  1  7  6
1  2  8  7
2  3  9  8

In [22]:
pd.merge(df1,df2,how="left")

   A  B    C
0  1  7  6.0
1  2  8  7.0
2  3  9  8.0
3  4  0  NaN

In [24]:
pd.merge(df1,df2,how="outer",indicator=True)

   A    B    C      _merge
0  1  7.0  6.0        both
1  2  8.0  7.0        both
2  3  9.0  8.0        both
3  4  0.0  NaN   left_only
4  5  NaN  9.0  right_only

In [30]:
pd.merge(df1,df2,left_index=True, right_index=True, suffixes=("name","id"))

   Aname  B  Aid  C
0      1  7    1  6
1      2  8    2  7
2      3  9    3  8
3      4  0    5  9

### Concat

In [41]:
pd.concat([df1,df2]) #default axis = 0

   A    B    C
0  1  7.0  NaN
1  2  8.0  NaN
2  3  9.0  NaN
3  4  0.0  NaN
0  1  NaN  6.0
1  2  NaN  7.0
2  3  NaN  8.0
3  5  NaN  9.0

In [42]:
pd.concat([df1,df2],keys=(["df1","df2"]),axis=1)

  df1    df2
    A  B   A  C
0   1  7   1  6
1   2  8   2  7
2   3  9   3  8
3   4  0   5  9

In [34]:
s1=pd.Series([1,2,3,4])
s2=pd.Series([12,23,34,45])
pd.concat([s1,s2])

0     1
1     2
2     3
3     4
0    12
1    23
2    34
3    45
dtype: int64

### Grouping (Groupby)

In [49]:
df3=pd.DataFrame({"A":['a','d','b','c','d','c','a','b'],"B":[12,32,423,542,0,34,54,43],"C":[13,4,5,2,5,7,9,1]})
df3

   A    B   C
0  a   12  13
1  d   32   4
2  b  423   5
3  c  542   2
4  d    0   5
5  c   34   7
6  a   54   9
7  b   43   1

In [55]:
df3_sorted = df3.groupby("A")
for a,b in df3_sorted:
    print(a)
    print(b,"\n")

a
   A   B   C
0  a  12  13
6  a  54   9

b
   A    B  C
2  b  423  5
7  b   43  1

c
   A    B  C
3  c  542  2
5  c   34  7

d
   A   B  C
1  d  32  4
4  d   0  5

In [56]:
df3_sorted.get_group("a")

   A   B   C
0  a  12  13
6  a  54   9

In [57]:
df3_sorted.min()

    B  C
A
a  12  9
b  43  1
c  34  2
d   0  4

In [58]:
df3_sorted.max()

     B   C
A
a   54  13
b  423   5
c  542   7
d   32   5

In [59]:
df3_sorted.mean()

       B     C
A
a   33.0  11.0
b  233.0   3.0
c  288.0   4.5
d   16.0   4.5

### Append and Join

In [60]:
df1.append(df2, ignore_index=True)

   A    B    C
0  1  7.0  NaN
1  2  8.0  NaN
2  3  9.0  NaN
3  4  0.0  NaN
4  1  NaN  6.0
5  2  NaN  7.0
6  3  NaN  8.0
7  5  NaN  9.0

In [61]:
df1.join(df2, how="outer", lsuffix="_0", rsuffix="_1")

   A_0  B  A_1  C
0    1  7    1  6
1    2  8    2  7
2    3  9    3  8
3    4  0    5  9

### Melt

In [70]:
df4=pd.DataFrame({"A":['a','b', 'c', 'd', 'e', 'f', 'g', 'h'],"B":[12,32,423,542,0,34,54,43],"C":[13,4,5,2,5,7,9,1]})
pd.melt(df4, id_vars=["A"], var_name="py", value_name="thon")

    A py  thon
0   a  B    12
1   b  B    32
2   c  B   423
3   d  B   542
4   e  B     0
5   f  B    34
6   g  B    54
7   h  B    43
8   a  C    13
9   b  C     4
10  c  C     5
11  d  C     2
12  e  C     5
13  f  C     7
14  g  C     9
15  h  C     1

### Pivot Table

In [77]:
df5=pd.DataFrame({"A":[0,9,8,7,6,5,4,3],"B":[12,32,423,542,0,34,54,43],"C":[13,4,5,2,5,7,9,1], "D":[1,2,3,4,5,6,7,8]})
df5.pivot(index="D",columns="B", values="C")

B  0     12   32   34   43   54   423  542
D
1  NaN  13.0  NaN  NaN  NaN  NaN  NaN  NaN
2  NaN   NaN  4.0  NaN  NaN  NaN  NaN  NaN
3  NaN   NaN  NaN  NaN  NaN  NaN  5.0  NaN
4  NaN   NaN  NaN  NaN  NaN  NaN  NaN  2.0
5  5.0   NaN  NaN  NaN  NaN  NaN  NaN  NaN
6  NaN   NaN  NaN  7.0  NaN  NaN  NaN  NaN
7  NaN   NaN  NaN  NaN  NaN  9.0  NaN  NaN
8  NaN   NaN  NaN  NaN  1.0  NaN  NaN  NaN

In [83]:
df5.pivot_table(index="D",columns="B",values="C", aggfunc="mean", margins=True) #sum

B      0    12   32   34   43   54  423  542    All
D
1    NaN  13.0  NaN  NaN  NaN  NaN  NaN  NaN  13.00
2    NaN   NaN  4.0  NaN  NaN  NaN  NaN  NaN   4.00
3    NaN   NaN  NaN  NaN  NaN  NaN  5.0  NaN   5.00
4    NaN   NaN  NaN  NaN  NaN  NaN  NaN  2.0   2.00
5    5.0   NaN  NaN  NaN  NaN  NaN  NaN  NaN   5.00
6    NaN   NaN  NaN  7.0  NaN  NaN  NaN  NaN   7.00
7    NaN   NaN  NaN  NaN  NaN  9.0  NaN  NaN   9.00
8    NaN   NaN  NaN  NaN  1.0  NaN  NaN  NaN   1.00
All  5.0  13.0  4.0  7.0  1.0  9.0  5.0  2.0   5.75

# COMPLETED